{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4fb54809",
   "metadata": {},
   "outputs": [],
   "source": [
    "# текст оттуда:\n",
    "\n",
    "# L FInal\n",
    "# 1. дан массив из 20 значений. выведите значения с 5-го индекса  по 10 включительно\n",
    "# 2. Дан массив, напишите программу чтобы найти минимальное значение и его индекс. Нельзя использовать встроенные функции такие как min() или index()\n",
    "# 3. дан массив arr и целевое target значение. Определите, есть ли в массиве два значения, сумма которых равна целевому зачению. Нельзя использовать одно и то же значение по одному индексу дважды.\n",
    "#     пример: arr = [0,1,3,6,8,9], target = 9\n",
    "#     output: [0,9], [1,8], [3,6]\n",
    "# Дан словарь, предоставляющий товары и их цены:\n",
    "# items = {\"cola\":55, \"shoro\": 65, \"mars\":40, \"sprite\":60, \"nan\":25, \"burger\":150, \"ruchka\":90}\n",
    "# 4. напишите программу, которая находит и выводит все товары, стоимость которых меньше target значения\n",
    "#     пример: товары, стоящие меньше target=50:  [\"nan\", \"mars\"]\n",
    "# 5. напишите программу для подсчтеа общей стоимости всех товаров в корзине (cart)\n",
    "#     например: cart = [\"cola\", \"sprite\", \"nan\"]\n",
    "#     output: 140 (sprite=60,nan=25, cola=55)\n",
    "# 6. измените словарь, применив скидку 10% ко всем тоарам, и выведите обновленный словарь.\n",
    "\n",
    "# дан файл jamilia.txt\n",
    "# 7. подсчитайте, сколько слов находится в файде.\n",
    "# 8. найдите самое длинное слово в файле.\n",
    "# 9. дано целевое (tARGET) слово. определите, сколько раз оно встречается в тексте.\n",
    "\n",
    "# дан csv файл grades.csv где первый столбец содержит имя студента, а в торой, третий и четвертый столбцы - его оценки экзаменов. exam1, exam2, exam3\n",
    "\n",
    "# 10.найдите средний балл каждого ученика и запишите его в новый csv файл. в файле должны юыть указаны имя студента и его средняя оценка.\n",
    "# 11. вычислите средний балл каждого экзамена и верните их.\n",
    "# 12. заполните класс\n",
    "# class Cinema:\n",
    "#     def _  init _ (seld, price) - > None\n",
    "#     def add_movie(self, name, schedule, quantity) - > boolean\n",
    "#     def remove_movie(self, name) -> boolean\n",
    "#     def update_schedule(self, name, new_schedule) - > boolean\n",
    "#     def book_ticket(self, name, date) - > str # return booking id\n",
    "#     def reffund_ticket(self, booking_id) - > boolean\n",
    "#     def earnings(self, name) -> in"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "365c984a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[99, 80, 87, 10, 34, 99]\n"
     ]
    }
   ],
   "source": [
    "from random import randint\n",
    "a=[randint(1,100) for _ in range(20)]\n",
    "\n",
    "def onetofive(a):\n",
    "    return a[5:11]\n",
    "print(onetofive(a))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "7cb37de0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "min_value: 1 min_index: 4\n"
     ]
    }
   ],
   "source": [
    "from random import randint\n",
    "a=[4,453,56,32,1,4,5,2,3]\n",
    "\n",
    "def min_index(a):\n",
    "    min_index=0\n",
    "    min_value=float('inf')\n",
    "    for i, v in enumerate(a):\n",
    "        if v<min_value:\n",
    "            min_value=v\n",
    "            min_index=i\n",
    "    return f'min_value: {min_value} min_index: {min_index}'\n",
    "print(min_index(a))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "a12dcc09",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[[2, 4]]\n"
     ]
    }
   ],
   "source": [
    "def issum(arr, target):\n",
    "    result=[]\n",
    "    for i in range(len(arr)):\n",
    "        for j in range(i+1, len(arr)):\n",
    "            if arr[i]+arr[j]==target:\n",
    "                result.append([arr[i], arr[j]])\n",
    "        return result\n",
    "print(issum([2,34,5,6,3,1,1,4,5,36,2,7,1], 6))\n",
    "\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "f4840cea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['cola', 'mars', 'nan']\n",
      "95.0\n",
      "{'cola': 49.5, 'shoro': 58.5, 'mars': 36.0, 'sprite': 54.0, 'nan': 22.5, 'burger': 135.0, 'ruchka': 81.0}\n"
     ]
    }
   ],
   "source": [
    "items = {\"cola\":55, \"shoro\": 65, \"mars\":40, \"sprite\":60, \"nan\":25, \"burger\":150, \"ruchka\":90}\n",
    "def menshe_target(x, target):\n",
    "    result=[]\n",
    "    for k, v in x.items():\n",
    "        if v<target:\n",
    "            result.append(k)\n",
    "    return result\n",
    "\n",
    "print(menshe_target(items, 60))\n",
    "\n",
    "def summa(x, cart):\n",
    "    total=0.0\n",
    "    for k, v in x.items():\n",
    "        if k in cart:\n",
    "            total+=v\n",
    "    return total\n",
    "print(summa(items, ['cola', 'mars']))\n",
    "\n",
    "def obnova(x):\n",
    "    new={}\n",
    "    for k, v in x.items():\n",
    "        new[k]=v-v/10\n",
    "    return new\n",
    "print(obnova(items))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2b22740f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
